Approach to Solve
You have to use fundamentals of Numpy and Pandas covered in module 4.
1. Read the three csv files which contains the score of same students in term1 for each Subject
2. Remove the name and ethnicity column (to ensure confidentiality)
3. Fill missing score data with zero
4. Merge the three files
5. Change Sex(M/F) Column to 1/2 for further analysis
6. Store the data in new file â€“ ScoreFinal.csv

Enhancements for code

You can try these enhancements in code
1. Convert ethnicity to numerical value
2. Fill the missing score for a student to the average of the class

### 1. Read the three csv files which contains the score of same students in term1 for each Subject

In [1]:
import warnings
warnings.filterwarnings('ignore')
import pandas as pd

In [2]:
df_maths = pd.read_csv('MathScoreTerm1.csv')
df_phy = pd.read_csv('PhysicsScoreTerm1.csv')
df_DSS = pd.read_csv('DSScoreTerm1.csv')

In [3]:
df_maths.head()

             Name  Score  Age         Ethinicity Subject Sex  ID
0  AI-KYUNG CHUNG   88.0   18     White American   Maths   M   1
1     ALAN HARVEY   85.0   19  European American   Maths   M   2
2    ALAN REYNAUD   45.0   19  European American   Maths   M   3
3  ALBERT CENDANA   82.0   18     White American   Maths   M   4
4  ALBERT HOLT JR   82.0   18     White American   Maths   F   5

In [4]:
df_phy.head()

             Name  Score  Age         Ethinicity  Subject Sex  ID
0  AI-KYUNG CHUNG   84.0   18     White American  Physics   M   1
1     ALAN HARVEY   81.0   19  European American  Physics   M   2
2    ALAN REYNAUD   41.0   19  European American  Physics   M   3
3  ALBERT CENDANA   78.0   18     White American  Physics   M   4
4  ALBERT HOLT JR   78.0   18     White American  Physics   F   5

In [5]:
df_DSS.head()

             Name  Score  Age         Ethinicity        Subject Sex  ID
0  AI-KYUNG CHUNG   82.0   18     White American  Data Structue   M   1
1     ALAN HARVEY   79.0   19  European American  Data Structue   M   2
2    ALAN REYNAUD   39.0   19  European American  Data Structue   M   3
3  ALBERT CENDANA   76.0   18     White American  Data Structue   M   4
4  ALBERT HOLT JR   76.0   18     White American  Data Structue   F   5

### 2. Remove the name and ethnicity column (to ensure confidentiality)

In [6]:
df_maths.drop(['Name','Ethinicity'], axis=1, inplace=True)

In [7]:
df_maths.head()

   Score  Age Subject Sex  ID
0   88.0   18   Maths   M   1
1   85.0   19   Maths   M   2
2   45.0   19   Maths   M   3
3   82.0   18   Maths   M   4
4   82.0   18   Maths   F   5

In [8]:
df_phy.drop(['Name','Ethinicity'], axis=1, inplace=True)
df_phy.head()

   Score  Age  Subject Sex  ID
0   84.0   18  Physics   M   1
1   81.0   19  Physics   M   2
2   41.0   19  Physics   M   3
3   78.0   18  Physics   M   4
4   78.0   18  Physics   F   5

In [9]:
df_DSS.drop(['Name','Ethinicity'], axis=1, inplace=True)
df_DSS.head()

   Score  Age        Subject Sex  ID
0   82.0   18  Data Structue   M   1
1   79.0   19  Data Structue   M   2
2   39.0   19  Data Structue   M   3
3   76.0   18  Data Structue   M   4
4   76.0   18  Data Structue   F   5

### 3. Fill missing score data with zero

In [10]:
df_maths.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 599 entries, 0 to 598
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Score    596 non-null    float64
 1   Age      599 non-null    int64
 2   Subject  599 non-null    object
 3   Sex      599 non-null    object
 4   ID       599 non-null    int64
dtypes: float64(1), int64(2), object(2)
memory usage: 23.5+ KB

In [11]:
df_maths = df_maths.fillna(0)

In [12]:
df_maths.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 599 entries, 0 to 598
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Score    599 non-null    float64
 1   Age      599 non-null    int64
 2   Subject  599 non-null    object
 3   Sex      599 non-null    object
 4   ID       599 non-null    int64
dtypes: float64(1), int64(2), object(2)
memory usage: 23.5+ KB

In [13]:
df_phy = df_phy.fillna(0)

In [14]:
df_DSS = df_DSS.fillna(0)

In [15]:
df_phy.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 599 entries, 0 to 598
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Score    599 non-null    float64
 1   Age      599 non-null    int64
 2   Subject  599 non-null    object
 3   Sex      599 non-null    object
 4   ID       599 non-null    int64
dtypes: float64(1), int64(2), object(2)
memory usage: 23.5+ KB

In [16]:
df_DSS.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 599 entries, 0 to 598
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Score    599 non-null    float64
 1   Age      599 non-null    int64
 2   Subject  599 non-null    object
 3   Sex      599 non-null    object
 4   ID       599 non-null    int64
dtypes: float64(1), int64(2), object(2)
memory usage: 23.5+ KB

### 4. Merge the three files

In [17]:
df_merge = pd.concat([df_maths, df_phy, df_DSS], ignore_index=True)

In [18]:
df_merge.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1797 entries, 0 to 1796
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Score    1797 non-null   float64
 1   Age      1797 non-null   int64
 2   Subject  1797 non-null   object
 3   Sex      1797 non-null   object
 4   ID       1797 non-null   int64
dtypes: float64(1), int64(2), object(2)
memory usage: 70.3+ KB

### 5. Change Sex(M/F) Column to 1/2 for further analysis

In [19]:
df_merge["Sex"] = [1 if sex == "M" else 2 for sex in df_merge["Sex"]]
print(df_merge)

      Score  Age        Subject  Sex   ID
0      88.0   18          Maths    1    1
1      85.0   19          Maths    1    2
2      45.0   19          Maths    1    3
3      82.0   18          Maths    1    4
4      82.0   18          Maths    2    5
...     ...  ...            ...  ...  ...
1792   39.0   19  Data Structue    2  595
1793   69.0   18  Data Structue    1  596
1794   47.0   20  Data Structue    1  597
1795   69.0   20  Data Structue    1  598
1796    0.0   19  Data Structue    1  599

[1797 rows x 5 columns]

### 6. Store the data in new file â€“ ScoreFinal.csv

In [20]:
df_merge.to_csv("ScoreFinal.csv")

Enhancements for code

You can try these enhancements in code

1. Convert ethnicity to numerical value
2. Fill the missing score for a student to the average of the class

In [21]:
df1_maths = pd.read_csv('MathScoreTerm1.csv')
df1_phy = pd.read_csv('PhysicsScoreTerm1.csv')
df1_DSS = pd.read_csv('DSScoreTerm1.csv')

### 1. Convert ethnicity to numerical value

In [22]:
df1_maths['Ethinicity'].value_counts()

White American       288
European American    156
Hispanic             124
African American      31
Name: Ethinicity, dtype: int64

In [23]:
df1_phy['Ethinicity'].value_counts()

White American       288
European American    156
Hispanic             124
African American      31
Name: Ethinicity, dtype: int64

In [24]:
df1_DSS['Ethinicity'].value_counts()

White American       288
European American    156
Hispanic             124
African American      31
Name: Ethinicity, dtype: int64

In [25]:
for ethin in range(len(df1_maths['Ethinicity'])):
    if df1_maths['Ethinicity'][ethin] == 'White American':
        df1_maths['Ethinicity'][ethin] = 1 
    elif df1_maths['Ethinicity'][ethin] == 'European American':
        df1_maths['Ethinicity'][ethin] = 2
    elif df1_maths['Ethinicity'][ethin] == 'Hispanic':
        df1_maths['Ethinicity'][ethin] = 3
    else:
        df1_maths['Ethinicity'][ethin] = 4

In [26]:
df1_maths['Ethinicity'].value_counts()

1    288
2    156
3    124
4     31
Name: Ethinicity, dtype: int64

In [27]:
for ethin in range(len(df1_phy['Ethinicity'])):
    if df1_phy['Ethinicity'][ethin] == 'White American':
        df1_phy['Ethinicity'][ethin] = 1 
    elif df1_phy['Ethinicity'][ethin] == 'European American':
        df1_phy['Ethinicity'][ethin] = 2
    elif df1_phy['Ethinicity'][ethin] == 'Hispanic':
        df1_phy['Ethinicity'][ethin] = 3
    else:
        df1_phy['Ethinicity'][ethin] = 4

In [28]:
df1_phy['Ethinicity'].value_counts()

1    288
2    156
3    124
4     31
Name: Ethinicity, dtype: int64

In [29]:
for ethin in range(len(df1_DSS['Ethinicity'])):
    if df1_DSS['Ethinicity'][ethin] == 'White American':
        df1_DSS['Ethinicity'][ethin] = 1 
    elif df1_DSS['Ethinicity'][ethin] == 'European American':
        df1_DSS['Ethinicity'][ethin] = 2
    elif df1_DSS['Ethinicity'][ethin] == 'Hispanic':
        df1_DSS['Ethinicity'][ethin] = 3
    else:
        df1_DSS['Ethinicity'][ethin] = 4

In [30]:
df1_DSS['Ethinicity'].value_counts()

1    288
2    156
3    124
4     31
Name: Ethinicity, dtype: int64

### 2. Fill the missing score for a student to the average of the class

In [31]:
df1_maths.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 599 entries, 0 to 598
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        599 non-null    object
 1   Score       596 non-null    float64
 2   Age         599 non-null    int64
 3   Ethinicity  599 non-null    object
 4   Subject     599 non-null    object
 5   Sex         599 non-null    object
 6   ID          599 non-null    int64
dtypes: float64(1), int64(2), object(4)
memory usage: 32.9+ KB

In [32]:
df2_maths = df1_maths.fillna(df1_maths['Score'].mean())

In [33]:
df2_maths.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 599 entries, 0 to 598
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        599 non-null    object
 1   Score       599 non-null    float64
 2   Age         599 non-null    int64
 3   Ethinicity  599 non-null    int64
 4   Subject     599 non-null    object
 5   Sex         599 non-null    object
 6   ID          599 non-null    int64
dtypes: float64(1), int64(3), object(3)
memory usage: 32.9+ KB

In [34]:
df2_phy = df1_phy.fillna(df1_phy['Score'].mean())

In [35]:
df2_phy.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 599 entries, 0 to 598
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        599 non-null    object
 1   Score       599 non-null    float64
 2   Age         599 non-null    int64
 3   Ethinicity  599 non-null    int64
 4   Subject     599 non-null    object
 5   Sex         599 non-null    object
 6   ID          599 non-null    int64
dtypes: float64(1), int64(3), object(3)
memory usage: 32.9+ KB

In [36]:
df2_DSS = df1_DSS.fillna(df1_DSS['Score'].mean())

In [37]:
df2_DSS.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 599 entries, 0 to 598
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        599 non-null    object
 1   Score       599 non-null    float64
 2   Age         599 non-null    int64
 3   Ethinicity  599 non-null    int64
 4   Subject     599 non-null    object
 5   Sex         599 non-null    object
 6   ID          599 non-null    int64
dtypes: float64(1), int64(3), object(3)
memory usage: 32.9+ KB